Revit 2026 API

# IExtElemChangeBeamSection Methods

---

The IExtElemChangeBeamSection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ChangeSection | The method that will be called when user wants to change beam section |

#### Reference

IExtElemChangeBeamSection Interface

Autodesk.Revit.DB.Structure Namespace